[M_Sage_Nakayamarama MissionDefinition]
TurnInDescription="You learned something about Zhongshan. Yes, nothing can kill him, but someone will."
MissionSummary="Find recordings of Nakayama's lost voices."
TeaserText="then your friends "
